In [6]:
import pandas as pd
x=[[10,20,30,40]]
df=pd.DataFrame(x)
df

    0   1   2   3
0  10  20  30  40

# read and write using pandas

In [7]:
import os

In [8]:
# get the current working directory
os.getcwd()

'C:\\Users\\AnilKumar\\OneDrive - Bourntec Solutions Pvt Ltd\\Desktop\\Data Science Handout\\Material\\Data Analytics\\pandas\\notebooks\\material_2'

In [9]:
#change current working directory
#os.chdir('C:\\Users\\anil\\Desktop\')

In [10]:
# list down all objects in the current working directory
#os.listdir('C:\\Users\\anil\\Documents')
#os.listdir('C:\\Users\\anil\\Desktop')

In [11]:
import pandas as pd

draft1 = pd.read_csv('test.csv')    # Supply the file name (path)

draft1.head(6)                           # Check the first 6 rows

,Rk,Player,Pos,Age,Tm,G,MP,PER,TS%,3PAr,...,Unnamed: 19,OWS,DWS,WS,WS/48,Unnamed: 24,OBPM,DBPM,BPM,VORP
0,1,Quincy Acy,PF,24,NYK,68,1287,11.9,0.533,0.181,...,NaN,1.0,0.7,1.7,0.063,NaN,-2.3,-0.8,-3.1,-0.3
1,2,Jordan Adams,SG,20,MEM,30,248,12.8,0.489,0.291,...,NaN,0.0,0.4,0.4,0.073,NaN,-1.8,1.2,-0.6,0.1
2,3,Steven Adams,C,21,OKC,70,1771,14.1,0.549,0.005,...,NaN,1.9,2.2,4.1,0.111,NaN,-1.4,1.8,0.4,1.1
3,4,Jeff Adrien,PF,28,MIN,17,215,14.2,0.494,0.000,...,NaN,0.2,0.2,0.4,0.087,NaN,-2.7,0.5,-2.2,0.0
4,5,Arron Afflalo,SG,29,TOT,78,2502,10.7,0.533,0.377,...,NaN,1.6,1.0,2.6,0.050,NaN,-0.5,-1.3,-1.8,0.1
5,5,Arron Afflalo,SG,29,DEN,53,1750,11.7,0.533,0.370,...,NaN,1.4,0.4,1.8,0.050,NaN,0.0,-1.6,-1.6,0.2

In [12]:
draft2 = pd.read_csv('test.tsv',sep='\t')  # Read a tsv into a DataFrame

draft2.head(6)                           # Check the first 6 rows

,Rk,Player,Pos,Age,Tm,G,MP,PER,TS%,3PAr,...,Unnamed: 19,OWS,DWS,WS,WS/48,Unnamed: 24,OBPM,DBPM,BPM,VORP
0,1,Quincy Acy,PF,24,NYK,68,1287,11.9,0.533,0.181,...,NaN,1.0,0.7,1.7,0.063,NaN,-2.3,-0.8,-3.1,-0.3
1,2,Jordan Adams,SG,20,MEM,30,248,12.8,0.489,0.291,...,NaN,0.0,0.4,0.4,0.073,NaN,-1.8,1.2,-0.6,0.1
2,3,Steven Adams,C,21,OKC,70,1771,14.1,0.549,0.005,...,NaN,1.9,2.2,4.1,0.111,NaN,-1.4,1.8,0.4,1.1
3,4,Jeff Adrien,PF,28,MIN,17,215,14.2,0.494,0.000,...,NaN,0.2,0.2,0.4,0.087,NaN,-2.7,0.5,-2.2,0.0
4,5,Arron Afflalo,SG,29,TOT,78,2502,10.7,0.533,0.377,...,NaN,1.6,1.0,2.6,0.050,NaN,-0.5,-1.3,-1.8,0.1
5,5,Arron Afflalo,SG,29,DEN,53,1750,11.7,0.533,0.370,...,NaN,1.4,0.4,1.8,0.050,NaN,0.0,-1.6,-1.6,0.2

In [13]:
draft3 = pd.read_excel('test.xlsx',        # Path to Excel file
                       sheet_name = 'Sheet1') # Name of sheet to read from

draft3.head(6)                            # Check the first 6 rows

,Rk,Player,Pos,Age,Tm,G,MP,PER,TS%,3PAr,...,Unnamed: 19,OWS,DWS,WS,WS/48,Unnamed: 24,OBPM,DBPM,BPM,VORP
0,1,Quincy Acy,PF,24,NYK,68,1287,11.9,0.533,0.181,...,NaN,1.0,0.7,1.7,0.063,NaN,-2.3,-0.8,-3.1,-0.3
1,2,Jordan Adams,SG,20,MEM,30,248,12.8,0.489,0.291,...,NaN,0.0,0.4,0.4,0.073,NaN,-1.8,1.2,-0.6,0.1
2,3,Steven Adams,C,21,OKC,70,1771,14.1,0.549,0.005,...,NaN,1.9,2.2,4.1,0.111,NaN,-1.4,1.8,0.4,1.1
3,4,Jeff Adrien,PF,28,MIN,17,215,14.2,0.494,0.000,...,NaN,0.2,0.2,0.4,0.087,NaN,-2.7,0.5,-2.2,0.0
4,5,Arron Afflalo,SG,29,TOT,78,2502,10.7,0.533,0.377,...,NaN,1.6,1.0,2.6,0.050,NaN,-0.5,-1.3,-1.8,0.1
5,5,Arron Afflalo,SG,29,DEN,53,1750,11.7,0.533,0.370,...,NaN,1.4,0.4,1.8,0.050,NaN,0.0,-1.6,-1.6,0.2

In [14]:
# Go to http://www.basketball-reference.com/leagues/NBA_2015_totals.html
# click the CSV button and then copy some data to the clipboard

BB_reference_data = pd.read_clipboard(sep=",")  # Read data from the clipboard

BB_reference_data.iloc[:, 0:10].head(5)   # Check 5 rows (10 columns only)

Empty DataFrame
Columns: ['a']
Index: []

In [15]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url
#BB_data[0].ix[:, 0:10].head(5)      # Check 5 rows (10 columns only)
BB_data[0].head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [16]:
#TypeError: '>' not supported between instances of 'str' and 'int'
#BB_data[0].iloc[:,:]>0
#BB_data[BB_data.iloc[:,:]>0]

In [17]:
#save data to 
BB_reference_data.to_csv("bb_data.csv") 

#os.listdir('C:\\Users\\intro_python10')

In [18]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [19]:
#titanic_train = pd.read_csv("https://gist.githubusercontent.com/anilkumar4274/e89d8808f4f19f49f41cfc08e7fc841b/raw/8a54556d283773673457a27f643a58636702866d/titanic.csv",sep='\t') 
titanic_train = pd.read_csv("titanic.csv",sep='\t')

In [20]:
titanic_train.size

1872

In [21]:
titanic_train.shape

(156, 12)

In [22]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [23]:
print(titanic_train.describe() )

       PassengerId    Survived      Pclass         Age       SibSp  \
count   156.000000  156.000000  156.000000  126.000000  156.000000
mean     78.500000    0.346154    2.423077   28.141508    0.615385
std      45.177428    0.477275    0.795459   14.613880    1.056235
min       1.000000    0.000000    1.000000    0.830000    0.000000
25%      39.750000    0.000000    2.000000   19.000000    0.000000
50%      78.500000    0.000000    3.000000   26.000000    0.000000
75%     117.250000    1.000000    3.000000   35.000000    1.000000
max     156.000000    1.000000    3.000000   71.000000    5.000000

            Parch        Fare
count  156.000000  156.000000
mean     0.397436   28.109587
std      0.870146   39.401047
min      0.000000    6.750000
25%      0.000000    8.003150
50%      0.000000   14.454200
75%      0.000000   30.371850
max      5.000000  263.000000

In [24]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [25]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [26]:
categorical = titanic_train.dtypes[titanic_train.dtypes == "object"].index
print(categorical)

titanic_train[categorical].describe()

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

                           Name   Sex Ticket        Cabin Embarked
count                       156   156    156           31      155
unique                      156     2    145           28        3
top     Braund, Mr. Owen Harris  male   2651  C23 C25 C27        S
freq                          1   100      2            2      110

In [27]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [28]:
del titanic_train["PassengerId"]     # Remove PassengerId

In [29]:
sorted(titanic_train["Name"])[0:15]   # Check the first 15 sorted names

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Allen, Mr. William Henry',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Mr. Anders Johan',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andreasson, Mr. Paul Edvin',
 'Andrew, Mr. Edgardo Samuel',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)',
 'Attalah, Miss. Malake',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Barton, Mr. David John',
 'Bateman, Rev. Robert James',
 'Baxter, Mr. Quigg Edmond']

In [30]:
titanic_train["Name"].describe()

count                         156
unique                        156
top       Braund, Mr. Owen Harris
freq                            1
Name: Name, dtype: object

In [31]:
titanic_train["Ticket"][0:15]       # Check the first 15 tickets

0            A/5 21171
1             PC 17599
2     STON/O2. 3101282
3               113803
4               373450
5               330877
6                17463
7               349909
8               347742
9               237736
10             PP 9549
11              113783
12           A/5. 2151
13              347082
14              350406
Name: Ticket, dtype: object

In [32]:
titanic_train["Ticket"].describe()

count      156
unique     145
top       2651
freq         2
Name: Ticket, dtype: object

In [33]:
del titanic_train["Ticket"]        # Remove Ticket

In [34]:
titanic_train["Cabin"][0:15]       # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [35]:
titanic_train["Cabin"].describe()  # Check number of unique cabins

count              31
unique             28
top       C23 C25 C27
freq                2
Name: Cabin, dtype: object

In [36]:
new_survived = pd.Categorical(titanic_train["Survived"])
new_survived

[0, 1, 1, 1, 0, ..., 1, 0, 0, 0, 0]
Length: 156
Categories (2, int64): [0, 1]

In [37]:
new_survived = pd.Categorical(titanic_train["Survived"])
new_survived = new_survived.rename_categories(["Died","Survived"])              

new_survived.describe()

            counts     freqs
categories
Died           102  0.653846
Survived        54  0.346154

In [38]:
new_Pclass = pd.Categorical(titanic_train["Pclass"],ordered=True)

new_Pclass = new_Pclass.rename_categories(["Class1","Class2","Class3"])     

new_Pclass.describe()

            counts     freqs
categories
Class1          30  0.192308
Class2          30  0.192308
Class3          96  0.615385

In [39]:
titanic_train.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [40]:
new_Pclass

['Class3', 'Class1', 'Class3', 'Class1', 'Class3', ..., 'Class1', 'Class3', 'Class3', 'Class3', 'Class1']
Length: 156
Categories (3, object): ['Class1' < 'Class2' < 'Class3']

In [41]:
titanic_train["Pclass"] = new_Pclass

In [42]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [43]:
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = np.array([cabin[0] for cabin in char_cabin]) # Take first letter

new_Cabin = pd.Categorical(new_Cabin)

new_Cabin .describe()

            counts     freqs
categories
A                2  0.012821
B                5  0.032051
C               10  0.064103
D                6  0.038462
E                3  0.019231
F                4  0.025641
G                1  0.006410
n              125  0.801282

In [44]:
titanic_train["Cabin"] = new_Cabin

In [45]:
dummy_vector = pd.Series([1,None,3,None,7,8])

dummy_vector.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [46]:
titanic_train["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: Age, Length: 156, dtype: float64

In [47]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [48]:
len(missing[0])

30

In [49]:
index = np.where(titanic_train["Fare"] == max(titanic_train["Fare"]) )
index
#titanic_train['Survived']
titanic_train.loc[index]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
27,0,Class1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,263.0,C,S
88,1,Class1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,263.0,C,S

In [50]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
titanic_train
titanic_train.loc[most_family]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Family
59,0,Class3,"Goodwin, Master. William Frederick",male,11.0,5,2,46.9,n,S,7
71,0,Class3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,46.9,n,S,7

In [51]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

In [52]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [53]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr))

Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32

In [54]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [55]:
print ("\nHolding functions\n",'-'*20, sep='')
print(pd.Series(data=[sum,print,len]))

Holding functions
--------------------
0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [56]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series(data=[d.keys, d.items, d.values]))

Holding objects from a dictionary
----------------------------------------
0    <built-in method keys of dict object at 0x0000...
1    <built-in method items of dict object at 0x000...
2    <built-in method values of dict object at 0x00...
dtype: object

In [57]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'AZ'])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser3= pd.Series(['CA', 'OR', 'NV', 'AZ'],[1,2,5,4])

In [58]:
ser1
ser3

1    CA
2    OR
5    NV
4    AZ
dtype: object

In [59]:
print ("\nIndexing by name of the item/object (string identifier)\n",'-'*56, sep='')
print("Value for CA in ser1:", ser1['CA'])
print("Value for AZ in ser1:", ser1['AZ'])
print("Value for NV in ser2:", ser2['NV'])

Indexing by name of the item/object (string identifier)
--------------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 4
Value for NV in ser2: 5

In [60]:
ser1

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [61]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[0])
print("Value for AZ in ser1:", ser1[3])
print("Value for NV in ser2:", ser2[2])

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 4
Value for NV in ser2: 5

In [62]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[1:4], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser1:
OR    2
CO    3
AZ    4
dtype: int64

In [63]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'AZ'])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser3 = ser1+ser2

In [64]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    8.0
CA    2.0
CO    NaN
NV    NaN
OR    4.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [65]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    16.0
CA     1.0
CO     NaN
NV     NaN
OR     4.0
dtype: float64

In [66]:
print ("\nOr even for combination of mathematical operations!\n",'-'*53, sep='')
print (np.exp(ser1)+np.log10(ser2))

Or even for combination of mathematical operations!
-----------------------------------------------------
AZ    55.200210
CA     2.718282
CO          NaN
NV          NaN
OR     7.690086
dtype: float64

In [67]:
import numpy as np
import pandas as pd
from numpy.random import randn as rn
np.random.seed(101)
matrix_data = rn(5,4) #shape
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe data frame looks like\n",'-'*45, sep='')
print(df)

The data frame looks like
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
type(df.X)

pandas.core.series.Series

In [69]:
type(df['X'])

pandas.core.series.Series

In [70]:
type(df[['X']])

pandas.core.frame.DataFrame

In [71]:
print("\nThe 'X' column\n",'-'*25, sep='')
print(df['X'])

The 'X' column
-------------------------
A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [72]:
print("\nType of the column: ", type(df['X']), sep='')
print("\nThe 'X' and 'Z' columns indexed by passing a list\n",'-'*55, sep='')
print(df[['X','Z']])

Type of the column: <class 'pandas.core.series.Series'>

The 'X' and 'Z' columns indexed by passing a list
-------------------------------------------------------
          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [73]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [74]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df.X)

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [75]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [76]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep='')
df = df.drop('New', axis=1) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1
print(df)

A column is dropped by using df.drop() method
-------------------------------------------------------
          W         X         Y         Z  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826              1.131958
B  0.651118 -0.319318 -0.848077  0.605965              0.286647
C -2.018168  0.740122  0.528813 -0.589001              0.151122
D  0.188695 -0.758872 -0.933237  0.955057              0.196184
E  0.190794  1.978757  2.605967  0.683509              2.662266

In [77]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          W         X         Y         Z  New (Sum of X and Z)
B  0.651118 -0.319318 -0.848077  0.605965              0.286647
C -2.018168  0.740122  0.528813 -0.589001              0.151122
D  0.188695 -0.758872 -0.933237  0.955057              0.196184
E  0.190794  1.978757  2.605967  0.683509              2.662266

In [78]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method

In [80]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.loc['C'])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [81]:
print("\nMultiple rows\n")
print(df.loc[['B','D']])

Multiple rows

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [82]:
df.loc['B':'D':2]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [83]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
print(df.loc['B','Y'])

-0.8480769834036315

In [85]:
df.loc[['A','C'],['X','Z']]

          X         Z
A  0.628133  0.503826
C  0.740122 -0.589001

In [86]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [88]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [89]:
#### Subsetting DataFrame

In [90]:
np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [91]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc['B','Y'])

Element at row 'B' and column 'Y' is

-0.8480769834036315

In [93]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.loc[['B','D'],['W','Y']]

Subset comprising of rows B and D, and columns W and Y, is

          W         Y
B  0.651118 -0.848077
D  0.188695 -0.933237

In [94]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [95]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [96]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

In [97]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [98]:
df[df.iloc[:,:]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [99]:
import pandas as pd
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [100]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [101]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])
print("\nComplete Row with Height > 65 inch\n",'-'*35, sep='')
df['Height'][df['Height']>65]

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

Complete Row with Height > 65 inch
-----------------------------------

A    66
B    70
D    68
Name: Height, dtype: int32

In [102]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [103]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [104]:
booldf1

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [105]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])
print(df[['Age','Weight']][booldf1])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160
   Age  Weight
A   22     140
B   42     148
D   35     160

In [106]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [107]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [108]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())
df

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [109]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [110]:
"Student.Teacher.Engineer.Doctor.Nurse".split(".")

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [111]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student.Teacher.Engineer.Doctor.Nurse".split(".")
#df['Profession'] = ['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [112]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [113]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
a = list(zip(outside,inside))
zip(outside,inside)

In [114]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(a)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [115]:
import pandas as pd
b = pd.MultiIndex.from_tuples(a)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(b)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [116]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(b))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [117]:
import numpy as np
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3),2), index= b, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
         A     B     C
G1 1  2.71  0.63  0.91
   2  0.50  0.65 -0.32
   3 -0.85  0.61 -2.02
G2 1  0.74  0.53 -0.59
   2  0.19 -0.76 -0.93
   3  0.96  0.19  1.98

In [118]:
print("\nSubsetting multi-index DataFrame using two 'loc' methods\n",'-'*60, sep='')
print(df1.loc['G2'].loc[[1,3]][['B','C']])

Subsetting multi-index DataFrame using two 'loc' methods
------------------------------------------------------------
      B     C
1  0.53 -0.59
3  0.19  1.98

In [119]:
print("\nNaming the indices by 'index.names' method\n",'-'*45, sep='')
df1.index.names=['Outer', 'Inner']
print(df1)

Naming the indices by 'index.names' method
---------------------------------------------
                A     B     C
Outer Inner
G1    1      2.71  0.63  0.91
      2      0.50  0.65 -0.32
      3     -0.85  0.61 -2.02
G2    1      0.74  0.53 -0.59
      2      0.19 -0.76 -0.93
      3      0.96  0.19  1.98

In [120]:
#cross tabulation like pivot table

In [121]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
          A     B     C
Inner
1      2.71  0.63  0.91
2      0.50  0.65 -0.32
3     -0.85  0.61 -2.02

In [122]:
print("\nGrabbing a cross-section from inner level (for all outer levels)\n",'-'*65, sep='')
print(df1.xs(2,level='Inner'))

Grabbing a cross-section from inner level (for all outer levels)
-----------------------------------------------------------------
          A     B     C
Outer
G1     0.50  0.65 -0.32
G2     0.19 -0.76 -0.93

In [123]:
from IPython.display import Image
Image('loc_iloc.jpg')

FileNotFoundError: No such file or directory: 'loc_iloc.jpg'

FileNotFoundError: No such file or directory: 'loc_iloc.jpg'

In [124]:
import pandas as pd

In [125]:
one=pd.Series([1,2,3],index=['a','b','c'])

In [126]:
one

a    1
b    2
c    3
dtype: int64

In [127]:
two=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [128]:
two

a    1
b    2
c    3
d    4
dtype: int64

In [129]:
data={'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}

In [130]:
df4=pd.DataFrame(data)

In [131]:
df4

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [132]:
df4.size

8

In [133]:
df4.shape

(4, 2)

# selecting columns

In [134]:
#series
df4.one

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [135]:
#series
df4['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [136]:
#dataframe
df4[['one']]

   one
a  1.0
b  2.0
c  3.0
d  NaN

In [137]:
#dataframe
df[['one','two']]

KeyError: "None of [Index(['one', 'two'], dtype='object')] are in the [columns]"

In [ ]:
df

# column addition

In [ ]:
df['three']=pd.Series([11,12,13],index=['a','b','c'])

In [ ]:
df

### Adding Two Columns

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'col_1': [0, 1, 2, 3],
    'col_2': [4, 5, 6, 7]
})

In [ ]:
df['column_new_1']=np.nan

In [ ]:
#df['column_new_1'], df['column_new_2'], df['column_new_3'] = [np.nan, 'dogs', 3]

In [ ]:
df[['column_new_1', 'column_new_2', 'column_new_3']] = pd.DataFrame([[np.nan, 'dogs', 3]], index=df.index)

In [ ]:
df

# Column deletion

In [ ]:
#deleting a column
df.pop('col_1')

In [ ]:
df

# Selecting Rows

In [ ]:
df

In [ ]:
df4.loc['a']

In [ ]:
df4

# rows addition

In [ ]:
df4

In [ ]:
df_e=pd.DataFrame([[5,14],[6,15]],columns=['two','three'])

In [ ]:
df_e

In [ ]:
df=df4.append(df_e)
df

In [ ]:
df.append({'two':100,'three':300},ignore_index=True)

# Row Deletion

In [ ]:
df

In [ ]:
df.drop('b',inplace=True)

In [ ]:
df

# Data Manipulation

In [ ]:
import pandas as pd
import numpy as np
a=np.arange(1,50)
a.ndim

In [ ]:
len(dir(np))

In [ ]:
len(dir(pd))

In [ ]:
df=pd.Series(a)

In [ ]:
df.ndim

In [ ]:
df.axes

In [ ]:
df1=pd.Series([11,12,13,14],index=['a','b','c','d'])
df2=pd.Series([11,12,13,14],index=[1,2,3,4])

In [ ]:
df1.head()

In [ ]:
df1.axes

In [ ]:
df2.axes

In [ ]:
df.head(30).tail(5)

In [ ]:
df.tail()

# df.sum(), df.iteritems(), df.itertuples(), df.std(),df.groupby().groups

# sum()

In [ ]:
import pandas as pd
import numpy as np
d={'odd':np.arange(1,100,2),'even':np.arange(0,100,2)}
df=pd.DataFrame(d)
df.head()

In [ ]:
#columns - axis=0
#rows - axis=1
df.sum(axis=1).head()

In [ ]:
df['odd'].sum()

In [ ]:
df.size

In [ ]:
df.shape

# std()

In [ ]:
df.std()

In [ ]:
df.mean()

In [ ]:
df.median()

# iteritems()
#### column-wise

In [ ]:
df.head()

In [ ]:
for i,j in df.iteritems():
    print(i,j)

# itertuples()
#### row-wise

In [ ]:
for row in df.itertuples():
    print(row)

# GroupBy operation

In [ ]:
world_cup={'Team':['India','west indies','Australia','Pakistan','Srilanka','Australia','Australia','Australia','India','Australia'],
          'Rank':[7,7,2,1,6,4,1,1,1,2],
          'Year':[2019,1999,2019,1978,2019,1980,1999,2019,1999,2019]}

In [ ]:
df=pd.DataFrame(world_cup)

In [ ]:
df

In [ ]:
df.groupby('Team').groups

In [ ]:
df.groupby('Year').groups

In [ ]:
df.groupby(['Team','Year']).groups

In [ ]:
df.head()

In [ ]:
grouped=df.groupby('Team')
for i,j in grouped:
    print(i,j)

In [ ]:
grouped.get_group('India')

In [ ]:
grouped.get_group('Australia')

In [ ]:
df

In [ ]:
world_cup={'Team':['India','west indies','Australia','Pakistan','Srilanka','Australia','Australia','Australia','India','Australia'],
          'Rank':[7,7,2,1,6,4,1,1,1,2],
          'Year':[2019,1999,2019,1978,2019,1980,1999,2019,1999,2019]}
df=pd.DataFrame(world_cup)
world_cup1={'Team':['India','Bangladesh','Australia','Srilanka','SouthAfrica','Canada','Canada','NewZland','India','Australia'],
          'Rank':[7,7,2,1,6,4,1,1,1,2],
          'Year':[2019,1999,2019,1978,2019,1980,1999,2019,1999,2019]}
df1=pd.DataFrame(world_cup1)

In [ ]:
#axis=1 column-wise
#axis=0 row-wise
df2=pd.concat([df,df1],axis=1,ignore_index=True)

In [ ]:
df3=pd.concat([df,df1],axis=0,ignore_index=True)

In [ ]:
df3

# concat | append
1.concat can add column-wise & row-wise | 1 . append can only add row-wise